#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-ffyUAirYmyEFjune

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
aws_key_pair.personal: Refreshing state... [id=personal]
aws_vpc.main: Refreshing state... [id=vpc-0840b0733c96900ff]
aws_security_group.allow_inbound_ssh: Refreshing state... [id=sg-0735bd8de7ebd28ec]
aws_instance.main: Refreshing state... [id=i-00e1c97632b63217f]
aws_internet_gateway.main: Refreshing state... [id=igw-024403a7777ad7eed]
aws_subnet.main: Refreshing state... [id=subnet-07b920fcb5af96614]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.main has been deleted
  - resource "aws_instance" "main" {
      - ami                                  = "ami-0a6b5206d1730bdce" -> null
      - arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-00e1c97632b63217f" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-west-1c" -> null
      - cpu_core_count                       = 2 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-00e1c97632b63217f" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t4g.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "personal" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-01ed11da8a298e86a" -> null
      - private_dns                          = "ip-10-0-0-103.eu-west-1.compute.internal" -> null
      - private_ip                           = "10.0.0.103" -> null
      - public_ip                            = "54.77.119.63" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-07b920fcb5af96614" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0735bd8de7ebd28ec",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-03eee444c484be83d" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0fc374d386fd18c53" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_security_group.allow_inbound_ssh has changed
  ~ resource "aws_security_group" "allow_inbound_ssh" {
        id                     = "sg-0735bd8de7ebd28ec"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ]
        name                   = "inbound-ssh"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # digitalocean_droplet.main has changed
  ~ resource "digitalocean_droplet" "main" {
        id                 = "196151282"
        name               = "main"
      ~ price_hourly       = 0.02976 -> 0.03571
      ~ price_monthly      = 20 -> 24
        tags               = []
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group.allow_inbound_ssh will be destroyed
  # (because aws_security_group.allow_inbound_ssh is not in configuration)
  - resource "aws_security_group" "allow_inbound_ssh" {
      - arn                    = "arn:aws:ec2:eu-west-1:558855412466:security-group/sg-0735bd8de7ebd28ec" -> null
      - description            = "Allow inbound SSH to an instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0735bd8de7ebd28ec" -> null
      - ingress                = [] -> null
      - name                   = "inbound-ssh" -> null
      - owner_id               = "558855412466" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0840b0733c96900ff" -> null
    }

  # aws_security_group.allow_ssh will be created
  + resource "aws_security_group" "allow_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow inbound SSH to an instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "inbound-ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0840b0733c96900ff"
    }

  # aws_security_group_rule.allow_all_outbound will be created
  + resource "aws_security_group_rule" "allow_all_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.allow_inbound_ssh will be created
  + resource "aws_security_group_rule" "allow_inbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 1 to destroy.


```

</details>